controllers/ClientsController.php

SELECT * FROM `clients` WHERE `phone`='+44 192 383 5726'
INSERT INTO `clients` (`phone`, `name`, `status`) VALUES ('+44 192 383 5726', 'Zulfikarally Tejani', 1)
---
    public function actionUpload(){
        $model = new CsvClientsImport();
        if(Yii::$app->request->isPost ) {

            $file_path = $_FILES['CsvClientsImport']['tmp_name']['csv'];
            if ($this->isCSV($file_path))  {
                $handle = fopen($file_path, "r");
                for ($i = 0; $row = fgetcsv($handle ); ++$i) {
                    if(!$i) continue;
                    $name = trim($row[0]);
                    $phone = trim($row[1]);
                    if(!$name || !$phone) continue;
                    $client = Clients::findOne([
                        'phone'=>$phone
                    ]);
                    if(!$client) $client = new Clients();
                    $client->phone = $phone;
                    $client->name = $name;
                    $client->status = 1;
                    $client->save();

SELECT * FROM `clients` WHERE `id`='4'
---
    protected function findModel($id)
    {
        if (($model = Clients::findOne($id)) !== null) {